# Trabalahndo com planilhas do Excel

In [2]:
# Importando a bilioteca
import pandas as pd

In [3]:
# leitura dos arquivos
df1 = pd.read_excel("./datasets/Aracaju.xlsx")
df2 = pd.read_excel("./datasets/Fortaleza.xlsx")
df3 = pd.read_excel("./datasets/Natal.xlsx")
df4 = pd.read_excel("./datasets/Recife.xlsx")
df5 = pd.read_excel("./datasets/Salvador.xlsx")

In [4]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
# juntando todos os arquivos 
df = pd.concat([df1, df2, df3, df4, df5])

In [6]:
#exibindo as 5 primeiras linhas 
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
142     Natal 2019-01-02    7.12    1034     1
45      Natal 2019-03-11  431.00     852     3
23   Salvador 2019-01-01  193.20    1036     3
89     Recife 2019-01-01   18.11     980     3
22     Recife 2019-01-01   39.53     983     3

In [11]:
# verificar o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [12]:
# Alterar o tipo de dado da coluna lojaID
df["LojaID"] = df["LojaID"].astype("object")

In [13]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [14]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

##  Tratando valores faltatntes

In [15]:
# consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [18]:
df["Vendas"].mean()

122.61180089485438

In [24]:
# Substitui ps valores vazios pela media
df["Vendas"].fillna(df["Vendas"].mean(),inplace=True)

In [26]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [28]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
10      Recife 2019-01-01   38.51    982     8
49   Fortaleza 2019-01-01  183.33   1002     6
165   Salvador 2019-01-02   11.54   1037     1
105  Fortaleza 2019-01-01  174.66   1004     1
198   Salvador 2019-01-02   13.65   1037     3
25   Fortaleza 2019-01-01   80.31   1004     4
170      Natal 2019-01-02    9.26   1035     3
60    Salvador 2019-01-01   96.01   1034     2
30    Salvador 2019-01-01   47.96   1034     2
59   Fortaleza 2019-01-01    6.31   1002     3
13       Natal 2018-09-12  458.00    852     4
109   Salvador 2019-03-02  124.37   1035     1
119   Salvador 2019-03-02  136.37   1034     2
100      Natal 2019-01-02  190.97   1036     2
3        Natal 2019-01-07  271.00    854     3

In [29]:
df["Vendas"].mean()

122.61180089485438

In [30]:
# Subistituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace = True)

In [31]:
# Apagando as linhas com valores nulos
df.dropna(inplace = True)

In [32]:
# apagando as linhas com valores nullos com base apenas em 1 colunas
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
# removendo linhas que este estjam com valores faltando em todas as colunas
df.dropna(how="all", inplace=True)

## Criando novas colunas

In [33]:
# Criando uma coluna de receitas 
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [34]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [35]:
df["Receita/Vendas"] = df["Receita"]/ df["Vendas"]

In [36]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [38]:
# Retornando a maior receita
df["Receita"].max()

3544.0

In [39]:
# retorna a menor receita
df["Receita"].min()

3.34

In [40]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [41]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [42]:
# agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [43]:
# Ordenando o cojunto de dados
df.sort_values("Receita", ascending= False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0